In [35]:
#import libraries
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
#import seaborn as sns

In [44]:
data = {
    'Date': [
        '2023-01-01', '2023-01-03', np.nan, '2023-01-02',
        np.nan, '2023-01-08', '2023-01-10', np.nan
    ],
   # 'person':['John Doe','Jane Doe'],
    'Temperature': [30, np.nan, 31, 32, 35, 31, np.nan, 29],
    'Humidity': [80, 82, 79, 78, np.nan, np.nan, 85, 81],
    'Country': ['USA', 'U.S.A', 'UNAITED STATES OF AMERICA', 'us', 'America', 'us', 'Usa', np.nan]
}
df = pd.DataFrame(data)
df.head()

         Date  Temperature  Humidity                    Country
0  2023-01-01         30.0      80.0                        USA
1  2023-01-03          NaN      82.0                      U.S.A
2         NaN         31.0      79.0  UNAITED STATES OF AMERICA
3  2023-01-02         32.0      78.0                         us
4         NaN         35.0       NaN                    America

missing value impute using scikit-learn

In [ ]:
round(df['Temperature'].median())

31

In [ ]:
df['Temperature']=df['Temperature'].fillna(df['Temperature'].median())

In [ ]:
df.isnull().sum().sort_values(ascending= False)

Date           3
Humidity       2
Country        1
Temperature    0
dtype: int64

In [ ]:
df.head()

         Date  Temperature  Humidity                    Country
0  2023-01-01         30.0      80.0                        USA
1  2023-01-03         31.0      82.0                      U.S.A
2         NaN         31.0      79.0  UNAITED STATES OF AMERICA
3  2023-01-02         32.0      78.0                         us
4         NaN         35.0       NaN                    America

impute date inconsistency value using scikit learn

In [ ]:
df['Date']=df['Date'].ffill()

In [ ]:
df.head()

         Date  Temperature  Humidity                    Country
0  2023-01-01         30.0      80.0                        USA
1  2023-01-03         31.0      82.0                      U.S.A
2  2023-01-03         31.0      79.0  UNAITED STATES OF AMERICA
3  2023-01-02         32.0      78.0                         us
4  2023-01-02         35.0       NaN                    America

In [ ]:
df['Humidity']=df['Humidity'].ffill()

In [ ]:
df.head()

         Date  Temperature  Humidity                    Country
0  2023-01-01         30.0      80.0                        USA
1  2023-01-03         31.0      82.0                      U.S.A
2  2023-01-03         31.0      79.0  UNAITED STATES OF AMERICA
3  2023-01-02         32.0      78.0                         us
4  2023-01-02         35.0      78.0                    America

In [ ]:
df['Country']=df['Country'].ffill()

In [ ]:
df.isnull().sum().sort_values(ascending=False)

Date           0
Temperature    0
Humidity       0
Country        0
dtype: int64

In [ ]:
#Harmonize the name of the country

country_mapping = {'USA':'United states','us':'United states','U.S.A':'United states','America':'United states','UNAITED STATES OF AMERICA':'United states'}
df['Country']=df['Country'].replace(country_mapping)

In [2]:
df.head()

NameError: name 'df' is not defined